app/controllers/movies_controller.rb

  def create
    @movie = Movie.new(movie_params)

    if @movie.save
---
INSERT INTO "movies" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "sergio"], ["created_at", "2021-11-26 22:27:16.128278"], ["updated_at", "2021-11-26 22:27:16.128278"]]