app/controllers/reservations_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "felipe@uc.cl"], ["LIMIT", 1]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."user_id" = $1  [["user_id", 3]]
---
  def show
    puts(params[:user_email])
    @user = User.find_by(email: params[:user_email])
    @reservation = Reservation.where(user_id: @user.id)

INSERT INTO "reservations" ("date", "row", "seats", "user_id", "schedule_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    user = User.get_or_create(params[:user_email], params[:user_name])
    @reservation = Reservation.new(
      date: params[:date],
      row: params[:row],
      schedule_id: params[:schedule_id],
      seats: params[:seats],
      user_id: user.id,
    )
    if @reservation.save

SELECT "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def set_reservation
      @reservation = Reservation.find(params[:id])