app/controllers/schedules_controller.rb

INSERT INTO "schedules" ("hour", "movie_id", "theater_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["hour", "noche"], ["movie_id", 2], ["theater_id", 3], ["created_at", "2021-11-28 05:20:46.982655"], ["updated_at", "2021-11-28 05:20:46.982655"]]
---
  def create
    @schedule = Schedule.new(schedule_params)

    if @schedule.save

SELECT "schedules".* FROM "schedules" WHERE "schedules"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_schedule
      @schedule = Schedule.find(params[:id])