app/models/movie.rb

  def get_all_info
    @schedules = Schedule.where(movie_id: self.id)
    to_return = {movie: self, schedule: { matine: [], tanda: [], nigth: []}}
    # iterate over the schedules finding the theater name and hour to fill to_teturn variable
    @schedules.each do |schedule|
      room_name = Theater.find(schedule.theater_id).name
---
SELECT "schedules".* FROM "schedules" WHERE "schedules"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "theaters".* FROM "theaters" WHERE "theaters"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]