app/models/reservation.rb

SELECT "reservations".* FROM "reservations" WHERE "reservations"."schedule_id" = $1 AND "reservations"."date" = $2  [["schedule_id", 3], ["date", "2014-08-19 01:11:54"]]
---
  def self.used_seats(schedule_id, date)
    reservations = Reservation.where(schedule_id: schedule_id, date: date)
    seats = (0..3).map{|x| (0..11).map{|y| 0}}

    reservations.each do |reservation|