app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "felipe@uc.cl"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "felipe@uc.cl"], ["name", "felipe"], ["created_at", "2021-11-28 19:43:19.223378"], ["updated_at", "2021-11-28 19:43:19.223378"]]
---
  def self.get_or_create(email, name)
    @user = User.find_by(email: email)
    if @user.nil?
      @user = User.create(email: email, name: name)